# Лабораторная работа №1: Последовательное умножение квадратных матриц

## Задание

Написать программу на языке C++ для перемножения двух квадратных матриц.

- **Исходные данные:** файлы, содержащие значения исходных матриц
- **Выходные данные:** файл со значениями результирующей матрицы, время выполнения, объём задачи
- **Верификация:** автоматизированная проверка корректности результатов с помощью Python (NumPy)

## Описание реализации

Программа реализует классический алгоритм умножения матриц с оптимизацией доступа к памяти: перед основным вычислением матрица B транспонируется, что обеспечивает последовательный доступ к элементам обеих матриц во внутреннем цикле (row-major порядок). Это улучшает эффективность использования кэша процессора.

### Формат входных файлов

```
n
a_11 a_12 ... a_1n
a_21 a_22 ... a_2n
...
a_n1 a_n2 ... a_nn
```

Первая строка — размерность матрицы, далее n строк по n целых чисел.

### Объём задачи

Количество арифметических операций при умножении матриц размера n×n:

**F = 2n³ − n²**

(n² скалярных произведений, каждое из которых включает n умножений и n−1 сложений)

## Исходный код

### main.cpp

```cpp
#include <iostream>
#include <fstream>
#include <vector>
#include <chrono>
#include <cstdlib>

using vec2d = std::vector<std::vector<int>>;

vec2d load(const char* path, int& dim) {
    std::ifstream in(path);
    if (!in) {
        std::cerr << "Failed to open: " << path << "\n";
        std::exit(1);
    }
    in >> dim;
    vec2d m(dim, std::vector<int>(dim));
    for (int r = 0; r < dim; r++)
        for (int c = 0; c < dim; c++)
            in >> m[r][c];
    return m;
}

void save(const char* path, const vec2d& m) {
    int dim = m.size();
    std::ofstream out(path);
    if (!out) {
        std::cerr << "Failed to write: " << path << "\n";
        std::exit(1);
    }
    out << dim << "\n";
    for (int r = 0; r < dim; r++) {
        for (int c = 0; c < dim; c++)
            out << m[r][c] << " \n"[c == dim - 1];
    }
}

vec2d matmul(const vec2d& a, const vec2d& b, int n) {
    vec2d bt(n, std::vector<int>(n));
    for (int r = 0; r < n; r++)
        for (int c = 0; c < n; c++)
            bt[c][r] = b[r][c];

    vec2d res(n, std::vector<int>(n, 0));
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            int acc = 0;
            for (int k = 0; k < n; k++)
                acc += a[i][k] * bt[j][k];
            res[i][j] = acc;
        }
    }
    return res;
}

int main(int argc, char** argv) {
    if (argc < 4) {
        std::cerr << "Usage: " << argv[0] << " <A> <B> <out>\n";
        return 1;
    }

    int na, nb;
    auto a = load(argv[1], na);
    auto b = load(argv[2], nb);

    if (na != nb) {
        std::cerr << "Dimension mismatch: " << na << " vs " << nb << "\n";
        return 1;
    }

    long long flops = 2LL * na * na * na - (long long)na * na;

    auto t0 = std::chrono::steady_clock::now();
    auto c = matmul(a, b, na);
    auto t1 = std::chrono::steady_clock::now();

    double sec = std::chrono::duration<double>(t1 - t0).count();

    save(argv[3], c);

    std::cout << na << "," << flops << "," << sec << ","
              << flops / sec / 1e6 << "\n";
    return 0;
}
```

## Верификация

Для проверки корректности результатов используется скрипт `verify.py`, который:
1. Загружает матрицы A, B и вычисленный результат C из файлов
2. Вычисляет эталонный результат с помощью NumPy: `C_expected = A @ B`
3. Сравнивает поэлементно C и C_expected

Все запуски экспериментов прошли верификацию успешно.

## Результаты экспериментов

Эксперименты проведены для матриц размером от 100×100 до 1200×1200, по 3 запуска на каждый размер.

| Размер (n) | Операций (F) | Среднее время, с | MFLOPS |
|:---:|:---:|:---:|:---:|
| 100 | 1 990 000 | 0.0001 | 29 174 |
| 200 | 15 960 000 | 0.0005 | 30 344 |
| 400 | 127 840 000 | 0.0049 | 26 108 |
| 600 | 431 640 000 | 0.0128 | 33 717 |
| 800 | 1 023 360 000 | 0.0319 | 32 118 |
| 1000 | 1 999 000 000 | 0.0590 | 33 920 |
| 1200 | 3 454 560 000 | 0.0992 | 34 844 |

### Зависимость времени выполнения от размера матрицы

```
Время (с)
  |
  0.10 |                                                        *
  0.09 |
  0.08 |
  0.07 |
  0.06 |                                              *
  0.05 |
  0.04 |
  0.03 |                                    *
  0.02 |
  0.01 |                          *
  0.00 | *       *       *
       +---+-------+-------+-------+-------+-------+---
        100     200     400     600     800    1000  1200   n
```

Зависимость времени от размера матрицы соответствует теоретической оценке O(n³): при увеличении n в 2 раза (например, с 600 до 1200) время возрастает примерно в 8 раз (0.0128 -> 0.0992), что подтверждает кубическую сложность алгоритма.

### Производительность

Производительность стабилизируется на уровне ~30 000–35 000 MFLOPS для матриц размером 200 и выше. Для самых маленьких матриц (100×100) наблюдается небольшое снижение производительности из-за фиксированных накладных расходов (чтение файлов, аллокация памяти), составляющих значительную долю общего времени.

## Сборка и запуск

```bash
# установка зависимостей для верификации
pip install -r requirements.txt

# сборка
make

# полный цикл: генерация матриц, умножение, верификация
make test

# запуск серии экспериментов
make experiments
```

## Выводы

1. Реализована программа перемножения квадратных матриц на C++ с оптимизацией транспонирования для улучшения кэш-локальности.
2. Экспериментально подтверждена кубическая зависимость времени выполнения от размера матрицы O(n³).
3. Производительность составляет порядка 30–35 GFLOPS, что является хорошим показателем для однопоточной реализации.
4. Корректность результатов подтверждена автоматической верификацией с помощью NumPy для всех размеров матриц.
